app/controllers/research_items_controller.rb

	def create
		@id = params[:id]

		unless @id.nil?
			@research_item = ResearchItem.find_by_id(@id)

			unless @research_item.nil?
				add_research_item_to_current_user(@research_item) unless current_user.has_research_item? @research_item.id
			else
				bloomberg_research_item = BloombergResearch.find_by_id(@id)
---
SELECT "research_items".* FROM "research_items" WHERE "research_items"."id" = 1 LIMIT 1
SELECT "bloomberg_researches".* FROM "bloomberg_researches" WHERE "bloomberg_researches"."id" = 0 LIMIT 1